-- Вставка данных в таблицу item (товары)
INSERT INTO item (title, description, price, img_path, count)
VALUES
    ('Кепка', 'Кепка синяя', 1000, 'cap.png', 20),
    ('Шапка', 'Шапка красная', 1200, 'hat.png', 15),
    ('Куртка', 'Куртка зимняя', 9800, 'jacket.png', 12),
    ('Шарф', 'Шарф женский', 1200, 'scarf.png', 12),
    ('Рубашка', 'Рубашка голубая', 2400, 'shirt.png', 15),
    ('Футболка', 'Футболка зелена', 2000, 't-shirt.png', 20),
    ('Майка', 'Майка черная', 1600, 'undershirt.png', 18);

-- Вставка данных в таблицу order (заказы)
INSERT INTO orders (created_at)
VALUES
    ('2023-08-10 10:00:00'),  -- Заказ 1
    ('2023-08-10 14:30:00'),  -- Заказ 2
    ('2023-08-11 09:00:00');  -- Заказ 3

-- Вставка данных в таблицу cart_item (товары в корзине)
-- Для заказа 1
INSERT INTO cart_item (item_id, quantity, orders_id)
VALUES
    (1, 2, 1),  -- 2 Кепки для заказа 1
    (3, 1, 1),  -- 1 Куртка для заказа 1
    (5, 1, 1);  -- 1 Рубашка для заказа 1

-- Для заказа 2
INSERT INTO cart_item (item_id, quantity, orders_id)
VALUES
    (2, 1, 2),  -- 1 Шапка для заказа 2
    (4, 2, 2),  -- 2 Шарфа для заказа 2
    (6, 3, 2);  -- 3 Футболки для заказа 2

-- Для заказа 3
INSERT INTO cart_item (item_id, quantity, orders_id)
VALUES
    (7, 1, 3),  -- 1 Майка для заказа 3
    (1, 1, 3);  -- 1 Кепка для заказа 3